#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-335209/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-335209/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-335209-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-335209-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-335209"/regions/"europe-central2"/zones/<null>]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/fw-allow-ingress-iap]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-central2/routers/nat-router]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-335209/global/firewalls/allow-all-internal]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-central2/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-central2/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-335209/europe-central2/nat-router/nat-gateway]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-335209-code-spark-job.py]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-335209/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-335209/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-335209/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-335209/serviceAccounts/tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-335209/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-335209/roles/composer.worker/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-335209/roles/dataproc.editor/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-335209-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-335209-data/roles/storage.objectUser/serviceAccount:tbd-2024l-335209-data@tbd-2024l-335209.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-335209/regions/europe-central2/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2024l-335209]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-335209/roles/composer.ServiceAgentV2Ext/serviceAccount:service-143640390419@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:61434fa700f7ffda4c8b5bf128488fd4c9786f15817a24365f43c778580cf2d7eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:acb5dfd5fc8442cad7d8a37f9e6b7f5797ad2c1deb3fb6ba67214f326ef5bc2a]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe-west1/environments/demo-lab]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-335209/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-335209/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-335209-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-335209-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-335209-conf-scripts/notebook_post_startup_script.sh]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-c06f768c-bucket-dags/dbt-dag.py]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-c06f768c-bucket-dags/data-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:fb05eca53c07f63ea9df6e342831ed77e845f7846b234b7ac35d38c356c94419eu.gcr.io/tbd-2024l-335209/dbt:1.7.13]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:f56f3ca1ec04c11bc5fe83a5714dd0ee8eaebc0183f05eb38ea4c56b56c0ebc7]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-335209/locations/europe-central2-b/instances/tbd-2024l-335209-notebook]
data.google_container_cluster.composer-gke-cluster: Still reading... [10s elapsed]
data.google_container_cluster.composer-gke-cluster: Read complete after 15s [id=projects/tbd-2024l-335209/locations/europe-west1/clusters/europe-west1-demo-lab-c06f768c-gke]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id       = "sha256:fb05eca53c07f63ea9df6e342831ed77e845f7846b234b7ac35d38c356c94419eu.gcr.io/tbd-2024l-335209/dbt:1.7.13"
      - name     = "eu.gcr.io/tbd-2024l-335209/dbt:1.7.13" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:61434fa700f7ffda4c8b5bf128488fd4c9786f15817a24365f43c778580cf2d7eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.composer.module.composer.google_composer_environment.composer_env has changed
  ~ resource "google_composer_environment" "composer_env" {
        id               = "projects/tbd-2024l-335209/locations/europe-west1/environments/demo-lab"
      + labels           = {}
        name             = "demo-lab"
        # (4 unchanged attributes hidden)

      ~ config {
            # (8 unchanged attributes hidden)

          ~ node_config {
              + tags                 = []
                # (8 unchanged attributes hidden)
            }

          ~ software_config {
              + airflow_config_overrides = {}
              + pypi_packages            = {}
                # (3 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (7 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_service.dbt-task-service will be created
  + resource "kubernetes_service" "dbt-task-service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dbt-app"
            }
          + name             = "dbt-task-service"
          + namespace        = "composer-user-workloads"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dbt-app"
            }
          + session_affinity                  = "None"
          + type                              = "NodePort"

          + port {
              + name        = "spark-driver"
              + node_port   = 30000
              + port        = 30000
              + protocol    = "TCP"
              + target_port = "30000"
            }
          + port {
              + name        = "spark-block-mgr"
              + node_port   = 30001
              + port        = 30001
              + protocol    = "TCP"
              + target_port = "30001"
            }
        }
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-335209/dbt:1.7.13"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "37c8d5efb37d76099d02d1a37a15570b73de34cb"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.13"
              + "PROJECT_NAME"      = "tbd-2024l-335209"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-335209/dbt:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-335209/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "135fc71dbb1f3b85232187afe260787b117f57b1"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-335209"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-335209/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-335209"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-335209/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:143640390419-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-335209-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:143640390419-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @JakubDziegielewski, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*